{
  "activation": "gelu",
  "architectures": [
    "DistilBertForSequenceClassification"
  ],
  "attention_dropout": 0.1,
  "dim": 768,
  "dropout": 0.1,
  "dtype": "float32",
  "hidden_dim": 3072,
  "id2label": {
    "0": "lookup",
    "1": "aggregation",
    "2": "leaderboard",
    "3": "comparison",
    "4": "trend",
    "5": "out_of_scope"
  },
  "initializer_range": 0.02,
  "label2id": {
    "aggregation": 1,
    "comparison": 3,
    "leaderboard": 2,
    "lookup": 0,
    "out_of_scope": 5,
    "trend": 4
  },
  "max_position_embeddings": 512,
  "model_type": "distilbert",
  "n_heads": 12,
  "n_layers": 6,
  "pad_token_id": 0,
  "problem_type": "single_label_classification",
  "qa_dropout": 0.1,
  "seq_classif_dropout": 0.2,
  "sinusoidal_pos_embds": false,
  "tie_weights_": true,
  "transformers_version": "4.57.3",
  "vocab_size": 30522
}
